# 1. Пользователь подаёт на ввод список из чисел, необходимо вывести список, состоящий только из чётных чисел (append)

nums = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]


# 2. Пользователь вводит слово, необходимо проверить, является ли слово палиндромом шалаш | шалаш

word = input('Введите слово: ')

# 3. Необходимо написать функцию, принимающую на вход список чисел. Она обрабатывает его и возвращает суммы пар чисел:
# << [1,2,3,4,5,6]
# >> [3,7,11]
# Если передано не чётное количество чисел для составления пар, последнее число не учитывается

